# Lecture 17 - Introduction to SQL

Monday 2021/03/29

## Lecture Notes and in-class exercises

---

## ‚ú® Structured Query Language (SQL)

### How do you pronounce SQL?

Although some people read SQL as *es-q-el*, it is most often read SQL as *sequel*. 

### Conceptual Overview

SQL stands for *Structured Query Language*. The three most important concepts are embedded in the name itself.

1. **Structured**: The data is structured. You work with *fixed* fields.
2. **Query**: You request information using a text query.
3. **Language**: Guess what, SQL is another programming language!

If Python was your first programming language, you can now brag about your second programming language. üòé

---

### ‚ùì Why use SQL? Can't we use Python (Pandas)? üêº

You're right. Using Pandas will be easier in most cases unless you're familiar with SQL. Many data science professionals will agree that Pandas is a more human-friendly method ([discussion here](https://datascience.stackexchange.com/questions/34357/why-do-people-prefer-pandas-to-sql)). You can perform the most common operations in SQL with Pandas ([comparison with SQL here](https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html)).

![Kevin](https://github.com/bdi475/images/blob/main/lecture-notes/sql/kevin-malone-pandas-sql.jpg?raw=true)

Huh? When are you supposed to use SQL then? ü§® You should use SQL when working with large data. Pandas works great... until you run out of memory (RAM). When you read data from a source, Pandas loads the entire data into memory by default. Pandas will fail if your data is too large. Although there are workarounds to split your data into chunks, it's still cumbersome to use Pandas in these cases.

---

## ‚ö°Ô∏è Database Management Systems (DBMS)

A database is a collection of data. A database management system is a software used to let users communicate with a database. There are many types of DBMS software. We will only cover relational database management systems (RDBMS). Many popular RDBMS exist, such as:

- MySQL
- Oracle Database
- MariaDB
- PostgreSQL
- SQLite

We will use [SQLite](https://www.sqlite.org/), since it is the easiest one to set up.

---

### ‚ùì Why use databases? Can't we use CSV files?

This discussion is somewhat similar to why we use SQL instead of Pandas. Relational database management systems have existed since the 1970s. They are highly optimized even when your data size is humongous. Of course, the performance is dependent on the *query* you write even if you use an RDBMS.

![Boardroom Meeting](https://github.com/bdi475/images/blob/main/lecture-notes/sql/data-storage-boardroom-meeting.jpg?raw=true)

---

## üìó CRUD Operations Exercise using a graphical tool

![CRUD acronym](https://github.com/bdi475/images/blob/main/lecture-notes/sql/crud-abbreviation.png?raw=true)

Go to [https://sqliteonline.com/](https://sqliteonline.com/) and try out these SQL queries.

---
**CREATE**: Create `employees` table.

```sql
CREATE TABLE IF NOT EXISTS employees (
  emp_id INTEGER PRIMARY KEY,
  name TEXT NOT NULL,
  department TEXT,
  salary REAL
);
```

---
**UPDATE**: Add employees information.

```sql
INSERT INTO employees (name, department, salary) VALUES ('Jake', 'HR', 140000.0);
INSERT INTO employees (name, department, salary) VALUES ('Erin', 'Marketing', 200000.0);
INSERT INTO employees (name, department, salary) VALUES ('Max', 'HR', 250000.0);
INSERT INTO employees (name, department, salary) VALUES ('Yushan', 'Marketing', 205000.0);
```

---
**READ**: Select `emp_id` and `name` fields from `employees` table.

```sql
SELECT emp_id, name
FROM employees;
```

---
**READ**: Select `emp_id`, `name`, and `department` fields of HR employees from `employees` table.

```sql
SELECT emp_id, name, department
FROM employees
WHERE department = "HR";
```

---
**READ**: Select `emp_id`, `name`, and `salary` fields of Marketing employees sorted by `salary` (highest salary first) from `employees` table.

```sql
SELECT emp_id, name, salary
FROM employees
WHERE department = "Marketing"
ORDER BY salary DESC;
```

---
**READ**:  Select all rows and columns from `employees` table.

```sql
SELECT * FROM employees;
```

---
**DELETE**: Delete all HR employees information

```sql
DELETE FROM employees WHERE department = "HR";
```

---

## üìò CRUD Operations using Jupyter notebook

‚ñ∂Ô∏è First, run the code cell below to import modules used for **üß≠ Check Your Work** sections and the autograder.

In [1]:
import unittest
import base64
tc = unittest.TestCase()

#### üëá Tasks

- ‚úîÔ∏è Import the following Python packages.
    1. `pandas`: Use alias `pd`.
    2. `numpy`: Use alias `np`.
    3. `sqlite3`: No alias

In [2]:
# YOUR CODE BEGINS
import pandas as pd
import numpy as np
import sqlite3
# YOUR CODE ENDS

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [3]:
import sys
tc.assertTrue('pd' in globals(), 'Check whether you have correctly imported Pandas with an alias.')
tc.assertTrue('np' in globals(), 'Check whether you have correctly imported NumPy with an alias.')
tc.assertTrue('sqlite3' in globals(), 'Check whether you have correctly imported the sqlite3 package.')

---
### üìå Create a database file and a table

‚ñ∂Ô∏è Run the code below to create a new SQLite database file named `airbnb.db` and create a table named `listings`.

In [4]:
# Connect to airbnb.db database file
# If the file does not exist, create a new file
conn = sqlite3.connect('airbnb.db')

# Create a cursor
# A cursor enables users of a DBMS to traverse through the result set
# without having to retrieve all results at once
c = conn.cursor()

# Drop (delete) listings table if it already exists
c.execute('DROP TABLE IF EXISTS listings')
conn.commit()

# Define a query
# Triple quotes (''') denote multiline strings
create_table_query = '''
CREATE TABLE IF NOT EXISTS listings (
    neighbourhood TEXT,
    room_type TEXT,
    bathrooms REAL,
    bedrooms REAL,
    price REAL,
    number_of_reviews INTEGER,
    review_score REAL,
    is_superhost INT
)
'''

c.execute(create_table_query)
conn.commit()

conn.close()

#### üß≠ Check your work

- ‚úîÔ∏è Once you're done, open the *Files* tab in the left menu and check that `airbnb.db` file has been created.

![file created](https://github.com/bdi475/images/blob/main/lecture-notes/sql/db-file-created.png?raw=true)

---
### üìå Populate a database table from a CSV file

‚ñ∂Ô∏è Run the code below to create a DataFrame named `df_listings`.

In [5]:
df_listings = pd.read_csv('https://github.com/bdi475/datasets/raw/main/chicago-airbnb-listings-small.csv')

display(df_listings.head(5))

,neighbourhood,room_type,bathrooms,bedrooms,price,number_of_reviews,review_score,is_superhost
0,Hyde Park,Private room,1.0,1.0,65.0,181,100.0,1
1,South Lawndale,Entire home/apt,1.0,3.0,117.0,395,96.0,1
2,West Town,Entire home/apt,1.0,3.0,70.0,389,93.0,1
3,Uptown,Private room,1.5,1.0,110.0,250,100.0,1
4,Near North Side,Private room,1.0,1.0,75.0,500,94.0,1

‚ñ∂Ô∏è Run the code below to populate the `listings` table. All data in `df_listings` will be inserted to the table.

In [6]:
conn = sqlite3.connect('airbnb.db')
c = conn.cursor()

tables = list(pd.read_sql_query('SELECT * FROM sqlite_master WHERE type="table";', con=conn)['tbl_name'])
if 'listings' in tables:
    c.execute(f'DELETE FROM listings')
    conn.commit()
    
df_listings.to_sql(name='listings', index=False, con=conn, if_exists='append')

conn.close()

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [7]:
# DO NOT CHANGE THE CODE IN THIS CELL
import glob
import os
user_db_files = glob.glob('*.db')

# Check if all files exist in the current directory
tc.assertTrue('airbnb.db' in user_db_files, f'Check if airbnb.db exists in {os.getcwd()}')

conn_checker = sqlite3.connect('airbnb.db')
table_to_check = 'listings'

# Check if table exists
user_tables = list(pd.read_sql_query('SELECT * FROM sqlite_master WHERE type="table";', con=conn_checker)['tbl_name'])
tc.assertTrue(table_to_check in user_tables, f'{table_to_check} does not exist in your NWT.db file!')

conn_checker.close()

---
### üìå Select all columns for all rows

#### üëá Tasks

- ‚úîÔ∏è Write a query that selects all columns for all rows.
- ‚úîÔ∏è Store your query in a new variable named `query_select_all`.

#### üöÄ Solution

```python
# YOUR CODE BEGINS
query_select_all = '''
SELECT *
FROM listings
'''
# YOUR CODE ENDS
```

In [8]:
# YOUR CODE BEGINS
query_select_all = '''
SELECT *
FROM listings
'''
# YOUR CODE ENDS

conn = sqlite3.connect('airbnb.db')

df_result = pd.read_sql_query(query_select_all, con=conn)
display(df_result)

conn.close()

,neighbourhood,room_type,bathrooms,bedrooms,price,number_of_reviews,review_score,is_superhost
0,Hyde Park,Private room,1.0,1.0,65.0,181,100.0,1
1,South Lawndale,Entire home/apt,1.0,3.0,117.0,395,96.0,1
2,West Town,Entire home/apt,1.0,3.0,70.0,389,93.0,1
3,Uptown,Private room,1.5,1.0,110.0,250,100.0,1
4,Near North Side,Private room,1.0,1.0,75.0,500,94.0,1
...,...,...,...,...,...,...,...,...
821,Near North Side,Private room,1.0,1.0,97.0,140,91.0,0
822,Edgewater,Entire home/apt,1.0,1.0,104.0,101,92.0,0
823,Lake View,Entire home/apt,1.0,1.0,106.0,132,99.0,1
824,Near North Side,Private room,1.0,1.0,114.0,329,91.0,0
825,Near North Side,Private room,1.0,1.0,127.0,173,92.0,0

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [9]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('airbnb.db')

decoded_query = base64.b64decode(b'ClNFTEVDVCAqIEZST00gbGlzdGluZ3MK').decode()
df_check = pd.read_sql_query(decoded_query, con=conn)

tc.assertEqual(df_result.shape, df_check.shape, 'Number of rows and/or columns is different')

conn.close()

---
### üìå Select only three columns for all rows

#### üëá Tasks

- ‚úîÔ∏è Write a query that only the following 3 columns from the `listings` table:
    1. `bathrooms`
    2. `bedrooms`
    3. `price`
- ‚úîÔ∏è Store your query in a new variable named `query_select_three_columns`.

#### üöÄ Solution

```python
# YOUR CODE BEGINS
query_select_three_columns = '''
SELECT bathrooms, bedrooms, price
FROM listings
'''
# YOUR CODE ENDS
```

In [10]:
# YOUR CODE BEGINS
query_select_three_columns = '''
SELECT bathrooms, bedrooms, price
FROM listings
'''
# YOUR CODE ENDS

conn = sqlite3.connect('airbnb.db')

df_result = pd.read_sql_query(query_select_three_columns, con=conn)
display(df_result)

conn.close()

     bathrooms  bedrooms  price
0          1.0       1.0   65.0
1          1.0       3.0  117.0
2          1.0       3.0   70.0
3          1.5       1.0  110.0
4          1.0       1.0   75.0
..         ...       ...    ...
821        1.0       1.0   97.0
822        1.0       1.0  104.0
823        1.0       1.0  106.0
824        1.0       1.0  114.0
825        1.0       1.0  127.0

[826 rows x 3 columns]

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [11]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('airbnb.db')

decoded_query = base64.b64decode(b'ClNFTEVDVCBiYXRocm9vbXMsIGJlZHJvb21zLCBwcmljZSBGUk9NIGxpc3RpbmdzCg==').decode()
df_check = pd.read_sql_query(decoded_query, con=conn)

tc.assertEqual(df_result.shape, df_check.shape, 'Number of rows and/or columns is different')

conn.close()

---
### üìå Select all columns of expensive listings

#### üëá Tasks

- ‚úîÔ∏è Write a query that selects all columns of listings with a daily price greater than $400 in the `listings` table:
- ‚úîÔ∏è Store your query in a new variable named `query_expensive_listings`.

#### üöÄ Solution

```python
# YOUR CODE BEGINS
query_expensive_listings = '''
SELECT *
FROM listings
WHERE price > 400
'''
# YOUR CODE ENDS
```

In [12]:
# YOUR CODE BEGINS
query_expensive_listings = '''
SELECT *
FROM listings
WHERE price > 400
'''
# YOUR CODE ENDS

conn = sqlite3.connect('airbnb.db')

df_result = pd.read_sql_query(query_expensive_listings, con=conn)
display(df_result)

conn.close()

,neighbourhood,room_type,bathrooms,bedrooms,price,number_of_reviews,review_score,is_superhost
0,Uptown,Entire home/apt,2.5,5.0,875.0,124,97.0,0
1,Near North Side,Entire home/apt,1.0,2.0,500.0,117,94.0,1

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [13]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('airbnb.db')

decoded_query = base64.b64decode(b'ClNFTEVDVCAqCkZST00gTElTVElOR1MKV0hFUkUgcHJpY2UgPiA0MDAK').decode()
df_check = pd.read_sql_query(decoded_query, con=conn)

tc.assertEqual(df_result.shape, df_check.shape, 'Number of rows and/or columns is different')

conn.close()

---
### üìå Select all columns of West Town listings

#### üëá Tasks

- ‚úîÔ∏è Write a query that selects all columns of listings in the "West Town" neighbourhood.
    - `WHERE neighbourhood = 'West Town'`
- ‚úîÔ∏è Store your query in a new variable named `query_west_town_listings`.

#### üöÄ Solution

```python
# YOUR CODE BEGINS
query_west_town_listings = '''
SELECT *
FROM listings
WHERE neighbourhood = 'West Town'
'''
# YOUR CODE ENDS
```

In [14]:
# YOUR CODE BEGINS
query_west_town_listings = '''
SELECT *
FROM listings
WHERE neighbourhood = 'West Town'
'''
# YOUR CODE ENDS

conn = sqlite3.connect('airbnb.db')

df_result = pd.read_sql_query(query_west_town_listings, con=conn)
display(df_result)

conn.close()

,neighbourhood,room_type,bathrooms,bedrooms,price,number_of_reviews,review_score,is_superhost
0,West Town,Entire home/apt,1.0,3.0,70.0,389,93.0,1
1,West Town,Entire home/apt,3.0,3.0,168.0,218,97.0,1
2,West Town,Entire home/apt,1.0,2.0,75.0,189,91.0,0
3,West Town,Private room,2.0,1.0,57.0,127,89.0,0
4,West Town,Private room,2.0,1.0,78.0,143,90.0,0
...,...,...,...,...,...,...,...,...
133,West Town,Private room,1.0,1.0,55.0,126,100.0,1
134,West Town,Entire home/apt,1.0,1.0,95.0,125,98.0,1
135,West Town,Entire home/apt,1.0,2.0,68.0,112,93.0,0
136,West Town,Entire home/apt,1.0,2.0,58.0,140,99.0,1
137,West Town,Entire home/apt,1.0,3.0,64.0,134,98.0,1

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [15]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('airbnb.db')

decoded_query = base64.b64decode(b'ClNFTEVDVCAqCkZST00gTElTVElOR1MKV0hFUkUgbmVpZ2hib3VyaG9vZCA9ICdXZXN0IFRvd24nCg==').decode()
df_check = pd.read_sql_query(decoded_query, con=conn)

tc.assertEqual(df_result.shape, df_check.shape, 'Number of rows and/or columns is different')

conn.close()

---
### üìå Sort all listings by price

#### üëá Tasks

- ‚úîÔ∏è Write a query that selects all listings and sorts the result by price in ascending order.
- ‚úîÔ∏è Store your query in a new variable named `query_sort_by_price`.

#### üöÄ Solution

```python
# YOUR CODE BEGINS
query_sort_by_price = '''
SELECT *
FROM listings
ORDER BY price
'''
# YOUR CODE ENDS
```

In [16]:
# YOUR CODE BEGINS
query_sort_by_price = '''
SELECT *
FROM listings
ORDER BY price
'''
# YOUR CODE ENDS

conn = sqlite3.connect('airbnb.db')

df_result = pd.read_sql_query(query_sort_by_price, con=conn)
display(df_result)

conn.close()

,neighbourhood,room_type,bathrooms,bedrooms,price,number_of_reviews,review_score,is_superhost
0,West Ridge,Shared room,2.0,1.0,13.0,153,95.0,0
1,North Lawndale,Shared room,1.0,1.0,14.0,118,91.0,0
2,West Ridge,Shared room,2.0,1.0,16.0,158,92.0,0
3,West Ridge,Shared room,2.0,1.0,16.0,124,95.0,0
4,Lower West Side,Private room,2.0,1.0,19.0,112,94.0,1
...,...,...,...,...,...,...,...,...
821,Near North Side,Entire home/apt,2.0,2.0,344.0,128,94.0,1
822,West Town,Entire home/apt,3.0,3.0,379.0,210,98.0,0
823,Lake View,Entire home/apt,2.0,5.0,400.0,113,99.0,1
824,Near North Side,Entire home/apt,1.0,2.0,500.0,117,94.0,1
825,Uptown,Entire home/apt,2.5,5.0,875.0,124,97.0,0

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [17]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('airbnb.db')

decoded_query = base64.b64decode(b'ClNFTEVDVCAqCkZST00gTElTVElOR1MKT1JERVIgQlkgcHJpY2UK').decode()
df_check = pd.read_sql_query(decoded_query, con=conn)

tc.assertEqual(df_result.shape, df_check.shape, 'Number of rows and/or columns is different')

conn.close()

---
### üìå Select only the price column and sort in descending order

#### üëá Tasks

- ‚úîÔ∏è Write a query that selects only the price column and sorts the result in descending order.
- ‚úîÔ∏è Store your query in a new variable named `query_sort_by_price_desc`.

#### üöÄ Solution

```python
# YOUR CODE BEGINS
query_sort_by_price_desc = '''
SELECT price
FROM listings
ORDER BY price DESC
'''
# YOUR CODE ENDS
```

In [18]:
# YOUR CODE BEGINS
query_sort_by_price_desc = '''
SELECT price
FROM listings
ORDER BY price DESC
'''
# YOUR CODE ENDS

conn = sqlite3.connect('airbnb.db')

df_result = pd.read_sql_query(query_sort_by_price_desc, con=conn)
display(df_result)

conn.close()

     price
0    875.0
1    500.0
2    400.0
3    379.0
4    344.0
..     ...
821   19.0
822   16.0
823   16.0
824   14.0
825   13.0

[826 rows x 1 columns]

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [19]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('airbnb.db')

decoded_query = base64.b64decode(b'ClNFTEVDVCBwcmljZQpGUk9NIExJU1RJTkdTCk9SREVSIEJZIHByaWNlIERFU0MK').decode()
df_check = pd.read_sql_query(decoded_query, con=conn)

tc.assertEqual(df_result.shape, df_check.shape, 'Number of rows and/or columns is different')
pd.testing.assert_series_equal(df_result['price'].reset_index(drop=True),
                               df_check['price'].reset_index(drop=True))

conn.close()

---
### üìå Final query

#### üëá Tasks

- ‚úîÔ∏è Write a query that:
    - Selects `room_type`, `bathrooms`, `bedrooms`, `price`, and `number_of_reviews` columns (in the same order).
    - Where `price` is less than 100 **AND** the number of reviews is greather than `500`.
    - Sorts by `number_of_reviews` in descending order.
- ‚úîÔ∏è Store your query in a new variable named `query_final`.

#### üöÄ Solution

```python
# YOUR CODE BEGINS
query_final = '''
SELECT room_type, bathrooms, bedrooms, price, number_of_reviews
FROM listings
WHERE (price < 100) AND (number_of_reviews > 500)
ORDER BY number_of_reviews DESC
'''
# YOUR CODE ENDS
```

In [20]:
# YOUR CODE BEGINS
query_final = '''
SELECT room_type, bathrooms, bedrooms, price, number_of_reviews
FROM listings
WHERE (price < 100) AND (number_of_reviews > 500)
ORDER BY number_of_reviews DESC
'''
# YOUR CODE ENDS

conn = sqlite3.connect('airbnb.db')

df_result = pd.read_sql_query(query_final, con=conn)
display(df_result)

conn.close()

         room_type  bathrooms  bedrooms  price  number_of_reviews
0     Private room        1.0       1.0   80.0                658
1  Entire home/apt        1.0       1.0   39.0                642
2  Entire home/apt        1.0       1.0   85.0                625
3       Hotel room        1.0       1.0   74.0                607
4  Entire home/apt        1.0       1.0   75.0                543
5  Entire home/apt        1.0       2.0   77.0                515
6  Entire home/apt        1.0       1.0   65.0                504

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [21]:
# DO NOT CHANGE THE CODE IN THIS CELL
conn = sqlite3.connect('airbnb.db')

decoded_query = base64.b64decode(b'ClNFTEVDVCByb29tX3R5cGUsIGJhdGhyb29tcywgYmVkcm9vbXMsIHByaWNlLCBudW1iZXJfb2ZfcmV2aWV3cwpGUk9NIExJU1RJTkdTCldIRVJFIChwcmljZSA8IDEwMCkgQU5EIChudW1iZXJfb2ZfcmV2aWV3cyA+IDUwMCkKT1JERVIgQlkgbnVtYmVyX29mX3Jldmlld3MgREVTQwo=').decode()
df_check = pd.read_sql_query(decoded_query, con=conn)

tc.assertEqual(df_result.shape, df_check.shape, 'Number of rows and/or columns is different')
pd.testing.assert_frame_equal(df_result.reset_index(drop=True),
                               df_check.reset_index(drop=True))

conn.close()